# step-1 : Load Libs

In [30]:
import pandas as pd

In [31]:
data = {
    'Name' : ["Sainath","Srinand","Aditya","Bal"],
    'Age'  : [21,20,20,20],
    'city' : ["Hyderabad","Hyderabad","Hyderabad","Hyderabad"]
}
print(data)

{'Name': ['Sainath', 'Srinand', 'Aditya', 'Bal'], 'Age': [21, 20, 20, 20], 'city': ['Hyderabad', 'Hyderabad', 'Hyderabad', 'Hyderabad']}

In [32]:
df = pd.DataFrame(data)
df

      Name  Age       city
0  Sainath   21  Hyderabad
1  Srinand   20  Hyderabad
2   Aditya   20  Hyderabad
3      Bal   20  Hyderabad

In [33]:
array_4d = [[[[1,2],[3,4]],[[4,5],[6,7]]],[[[1,2],[2,3]],[[3,4],[4,5]]]]

In [34]:
array_df = pd.DataFrame(array_4d, columns=['column1','column2'])
array_df

            column1           column2
0  [[1, 2], [3, 4]]  [[4, 5], [6, 7]]
1  [[1, 2], [2, 3]]  [[3, 4], [4, 5]]

# Step-2 : Rename

In [35]:
array_df.rename(columns={'column1' : 'fcol', 'column2' : 'scol'})

               fcol              scol
0  [[1, 2], [3, 4]]  [[4, 5], [6, 7]]
1  [[1, 2], [2, 3]]  [[3, 4], [4, 5]]

In [36]:
array_df

            column1           column2
0  [[1, 2], [3, 4]]  [[4, 5], [6, 7]]
1  [[1, 2], [2, 3]]  [[3, 4], [4, 5]]

# Step-3 : Load the Datasets from systems

In [37]:
df1 = pd.read_csv("./dataset.csv")

In [38]:
df1

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

In [39]:
df1.info()

<class 'pandas.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 14 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       303 non-null    int64
 1   sex       303 non-null    int64
 2   cp        303 non-null    int64
 3   trestbps  303 non-null    int64
 4   chol      303 non-null    int64
 5   fbs       303 non-null    int64
 6   restecg   303 non-null    int64
 7   thalach   303 non-null    int64
 8   exang     303 non-null    int64
 9   oldpeak   303 non-null    float64
 10  slope     303 non-null    int64
 11  ca        303 non-null    int64
 12  thal      303 non-null    int64
 13  target    303 non-null    int64
dtypes: float64(1), int64(13)
memory usage: 33.3 KB

In [40]:
df1.head(10)

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
5,57,1,0,140,192,0,1,148,0,0.4,1,0,1,1
6,56,0,1,140,294,0,0,153,0,1.3,1,0,2,1
7,44,1,1,120,263,0,1,173,0,0.0,2,0,3,1
8,52,1,2,172,199,1,1,162,0,0.5,2,0,3,1
9,57,1,2,150,168,0,1,174,0,1.6,2,0,2,1

#Method 8

In [41]:
df1['age'].value_counts()

age
58    19
57    17
54    16
59    14
52    13
51    12
56    11
44    11
62    11
60    11
41    10
64    10
63     9
67     9
43     8
42     8
61     8
65     8
53     8
45     8
55     8
48     7
50     7
66     7
46     7
49     5
47     5
39     4
35     4
68     4
70     4
69     3
40     3
71     3
38     3
37     2
34     2
29     1
74     1
76     1
77     1
Name: count, dtype: int64

In [42]:
df1.value_counts()

age  sex  cp  trestbps  chol  fbs  restecg  thalach  exang  oldpeak  slope  ca  thal  target
38   1    2   138       175   0    1        173      0      0.0      2      4   2     1         2
63   1    3   145       233   1    0        150      0      2.3      0      0   1     1         1
37   1    2   130       250   0    1        187      0      3.5      0      0   2     1         1
41   0    1   130       204   0    0        172      0      1.4      2      0   2     1         1
56   1    1   120       236   0    1        178      0      0.8      2      0   2     1         1
                                                                                               ..
57   0    0   140       241   0    1        123      1      0.2      1      0   3     0         1
45   1    3   110       264   0    1        132      0      1.2      1      0   3     0         1
68   1    0   144       193   1    1        141      0      3.4      1      2   3     0         1
57   1    0   130       131   0    1        115      1      1.2      1      1   3     0         1
     0    1   130       236   0    0        174      0      0.0      1      1   2     0         1
Name: count, Length: 302, dtype: int64

In [43]:
df1.isna()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,False,False,False,False,False,False,False,False,False,False,False,False,False,False
299,False,False,False,False,False,False,False,False,False,False,False,False,False,False
300,False,False,False,False,False,False,False,False,False,False,False,False,False,False
301,False,False,False,False,False,False,False,False,False,False,False,False,False,False
302,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [44]:
df1.shape

(303, 14)

In [47]:
df1

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

In [48]:
df1.sort_values(by='age', ascending=True)

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
72,29,1,1,130,204,0,0,202,0,0.0,2,0,2,1
58,34,1,3,118,182,0,0,174,0,0.0,2,0,2,1
125,34,0,1,118,210,0,1,192,0,0.7,2,0,2,1
65,35,0,0,138,183,0,1,182,0,1.4,2,0,2,1
227,35,1,0,120,198,0,1,130,1,1.6,1,0,3,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
151,71,0,0,112,149,0,1,125,0,1.6,1,0,2,1
60,71,0,2,110,265,1,0,130,0,0.0,2,1,2,1
129,74,0,1,120,269,0,0,121,1,0.2,2,1,2,1
144,76,0,2,140,197,0,2,116,0,1.1,1,0,2,1
238,77,1,0,125,304,0,0,162,1,0.0,2,3,2,0

In [53]:
df1.groupby('sex')['age'].mean()

sex
0    55.677083
1    53.758454
Name: age, dtype: float64

In [57]:
df1.groupby('sex')[['age','cp']].mean()

           age        cp
sex
0    55.677083  1.041667
1    53.758454  0.932367

In [58]:
df1.groupby('sex').mean()

,age,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
sex,,,,,,,,,,,,,
0,55.677083,1.041667,133.083333,261.302083,0.12500,0.572917,151.125000,0.229167,0.876042,1.427083,0.552083,2.125000,0.750000
1,53.758454,0.932367,130.946860,239.289855,0.15942,0.507246,148.961353,0.371981,1.115459,1.386473,0.811594,2.400966,0.449275

In [61]:
df1.iloc[1:10,1:5]

   sex  cp  trestbps  chol
1    1   2       130   250
2    0   1       130   204
3    1   1       120   236
4    0   0       120   354
5    1   0       140   192
6    0   1       140   294
7    1   1       120   263
8    1   2       172   199
9    1   2       150   168

In [67]:
df1.loc[df1['age'] > 30,'sex']

0      1
1      1
2      0
3      1
4      0
      ..
298    0
299    1
300    1
301    1
302    0
Name: sex, Length: 302, dtype: int64

In [79]:
df1['age'] > 40,df1['chol']>150

(0       True
 1      False
 2       True
 3       True
 4       True
        ...
 298     True
 299     True
 300     True
 301     True
 302     True
 Name: age, Length: 303, dtype: bool,
 0       True
 1       True
 2       True
 3       True
 4       True
        ...
 298     True
 299     True
 300     True
 301    False
 302     True
 Name: chol, Length: 303, dtype: bool)

In [83]:
df1['age'].unique()

array([63, 37, 41, 56, 57, 44, 52, 54, 48, 49, 64, 58, 50, 66, 43, 69, 59,
       42, 61, 40, 71, 51, 65, 53, 46, 45, 39, 47, 62, 34, 35, 29, 55, 60,
       67, 68, 74, 76, 70, 38, 77])

In [86]:
for col in df1.columns:
    print(df1[col].unique())

[63 37 41 56 57 44 52 54 48 49 64 58 50 66 43 69 59 42 61 40 71 51 65 53
 46 45 39 47 62 34 35 29 55 60 67 68 74 76 70 38 77]
[1 0]
[3 2 1 0]
[145 130 120 140 172 150 110 135 160 105 125 142 155 104 138 128 108 134
 122 115 118 100 124  94 112 102 152 101 132 148 178 129 180 136 126 106
 156 170 146 117 200 165 174 192 144 123 154 114 164]
[233 250 204 236 354 192 294 263 199 168 239 275 266 211 283 219 340 226
 247 234 243 302 212 175 417 197 198 177 273 213 304 232 269 360 308 245
 208 264 321 325 235 257 216 256 231 141 252 201 222 260 182 303 265 309
 186 203 183 220 209 258 227 261 221 205 240 318 298 564 277 214 248 255
 207 223 288 160 394 315 246 244 270 195 196 254 126 313 262 215 193 271
 268 267 210 295 306 178 242 180 228 149 278 253 342 157 286 229 284 224
 206 167 230 335 276 353 225 330 290 172 305 188 282 185 326 274 164 307
 249 341 407 217 174 281 289 322 299 300 293 184 409 259 200 327 237 218
 319 166 311 169 187 176 241 131]
[1 0]
[0 1 2]
[150 187 172 178 163 148 153 173 162 174 160 139 171 144 158 114 151 161
 179 137 157 123 152 168 140 188 125 170 165 142 180 143 182 156 115 149
 146 175 186 185 159 130 190 132 147 154 202 166 164 184 122 169 138 111
 145 194 131 133 155 167 192 121  96 126 105 181 116 108 129 120 112 128
 109 113  99 177 141 136  97 127 103 124  88 195 106  95 117  71 118 134
  90]
[0 1]
[2.3 3.5 1.4 0.8 0.6 0.4 1.3 0.  0.5 1.6 1.2 0.2 1.8 1.  2.6 1.5 3.  2.4
 0.1 1.9 4.2 1.1 2.  0.7 0.3 0.9 3.6 3.1 3.2 2.5 2.2 2.8 3.4 6.2 4.  5.6
 2.9 2.1 3.8 4.4]
[0 2 1]
[0 2 1 3 4]
[1 2 3 0]
[1 0]

In [87]:
df1.nunique()

age          41
sex           2
cp            4
trestbps     49
chol        152
fbs           2
restecg       3
thalach      91
exang         2
oldpeak      40
slope         3
ca            5
thal          4
target        2
dtype: int64

In [97]:
df1[(df1['age']) > 20 & (df1['age'] < 60)]

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

In [101]:
df1[(df1['age'] > 20) & (df1['age'] < 60)].sum()

age         10652.0
sex           155.0
cp            211.0
trestbps    27614.0
chol        51365.0
fbs            30.0
restecg       118.0
thalach     32720.0
exang          67.0
oldpeak       189.7
slope         307.0
ca            121.0
thal          488.0
target        127.0
dtype: float64

In [100]:
df1[df1['age'] > 20][df1[df1['age'] > 20]['age'] < 60].sum()

age         10652.0
sex           155.0
cp            211.0
trestbps    27614.0
chol        51365.0
fbs            30.0
restecg       118.0
thalach     32720.0
exang          67.0
oldpeak       189.7
slope         307.0
ca            121.0
thal          488.0
target        127.0
dtype: float64

In [102]:
df1['chol_level'] = df1['chol'].apply(lambda x: 'high' if x > 200 else 'low' if x <= 30 else 'normal')

In [107]:
df1

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target,chol_level
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1,high
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1,high
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1,high
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1,high
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1,high
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0,high
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0,high
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0,normal
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0,normal
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0,high

In [113]:
df1[df1.duplicated()]

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target,chol_level
164,38,1,2,138,175,0,1,173,0,0.0,2,4,2,1,normal

In [116]:
df1.drop_duplicates(inplace=True)

In [117]:
df1[df1.duplicated()]

Empty DataFrame
Columns: [age, sex, cp, trestbps, chol, fbs, restecg, thalach, exang, oldpeak, slope, ca, thal, target, chol_level]
Index: []

In [118]:
df1.reset_index(drop=True, inplace=True)

In [119]:
df1

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target,chol_level
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1,high
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1,high
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1,high
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1,high
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1,high
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
297,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0,high
298,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0,high
299,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0,normal
300,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0,normal
301,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0,high